// Гончигсумлай хоолны газар оров. Орсон хоолны газар нь 5000₮ - 30000₮ хооронд 15% нэмж төлдөг, бусад үед 20% - ийг нэмж төлдөг бол. Гончигсумлай өөртөө зориулан нийт төлбөр буцаадаг function бичжээ. Эдгээр тохиолдолуудад тус бүр хэдийг төлөхийг function - оор олно уу? 3000₮, 27500₮, 100000₮.

function tip(a, b, c) {
  if (5000 <= tip <= 30000) {
  }
}

// 1. Нийт төлбөр ийг олдог 1 function.

// 2. Зөвхөн нэмэгдэл төлбөрийг олдог 1 function.
// 3. Нийт төлбөрийн дундаж - ийг олдог 1 function.
