// Гончигсумлай хоолны газар оров. Орсон хоолны газар нь 5000₮ - 30000₮ хооронд 15% нэмж төлдөг, бусад үед 20% - ийг нэмж төлдөг бол. Гончигсумлай өөртөө зориулан нийт төлбөр буцаадаг function бичжээ. Эдгээр тохиолдолуудад тус бүр хэдийг төлөхийг function - оор олно уу? 3000₮, 27500₮, 100000₮.

// console.log("----------------------------------");

function cost(a, b, c) {
  for(i = 0; i <= cost.length; i++) {
    if (5000 <= cost[i] && cost[i] <= 30000) {
      costWtip = cost[i] + (cost[i] * 15)/100;
    }else {
      costWtip = cost[i] + (cost[i] * 20)/100;
    }
  } return costWtip;
} cost(3000, 27500, 100000);

// console.log("----------------------------------");

// 1. Нийт төлбөр ийг олдог 1 function.

// function cost(a) {
//   if (5000 <= a && a <= 30000) {
//     return console.log(a + (a * 15)/100);
//   }else {
//     return console.log(a + (a * 20)/100);
//   }
// }cost(3000);

// console.log("----------------------------------");

// 2. Зөвхөн нэмэгдэл төлбөрийг олдог 1 function.

function cost(a) {
  if (5000 <= a && a <= 30000) {
    return console.log((a * 15)/100);
  }else {
    return console.log((a * 20)/100);
  }
}cost(3000);

// console.log("----------------------------------");

// 3. Нийт төлбөрийн дундаж - ийг олдог 1 function.

