// Assignment -1

// 1. Эхлээд console.log() ашиглахгүйгээр дараах харьцуулалтын илэрхийллийн үр дүнг тодорхойл. Үр дүнгээ шийдсэний дараа console.log() ашиглан баталгаажуулна уу.
let i = 4 > 3; //true
let iii = 4 < 3; //false
let ii = 4 >= 3;
let iv = 4 <= 3;
let v = 4 == 4;
let vi = 4 === 4;
let vii = 4 != 4;
let iix = 4 !== 4;
let ix = 4 != "4";
let x = 4 == "4";
let xi = 4 === "4";

console.log(xi);

// 2. Эхлээд console.log() ашиглахгүйгээр дараах харьцуулалтын илэрхийллийн үр дүнг тодорхойл. Үр дүнгээ шийдсэний дараа console.log() ашиглан баталгаажуулна уу.
// let one = 4 > 3 && 10 < 12;
// let two = 4 > 3 && 10 > 12;
// let three = 4 > 3 || 10 < 12;
// let four = 4 > 3 || 10 > 12;
// let five = !(4 > 3);
// let six = !(4 < 3);
// let eight = !(4 > 3 && 10 < 12);
// let nine = !(4 > 3 && 10 > 12);
// let ten = !(4 === "4");

// 3.if … else ашиглан myAge болон yourAge-ийн утгыг харьцуул. Харьцуулалт дээр үндэслэн үр дүнг консол руу хөгшин (би эсвэл та) гэж тэмдэглэнэ үү. Насыг оруулахын тулд prompt("Насаа оруулна уу:")-г ашиглана уу.

// 4. Амралтын өдөр эсвэл ажлын өдөр эсэхийг шалгаарай.

// 5. Хэрэглэгчээс цаг оруулах, цаг тутамд үнэлгээ өгөх скрипт бичээрэй. Тухайн хүний цалинг тооцно уу
// let hours = 40
// let ratePerHour = 28
